       *> MOST OF YOU DON'T EVEN KNOW COBOL OR MAYBE YOU KNOW A LITTLE.
       *> I DON'T KNOW IF THIS IS CURSED OR NOT.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-HELLO-WORLD.
           05  WS-HELLO PIC X(5) VALUE 'HELLO'.
           05  WS-WORLD PIC X(7) VALUE ' WORLD!'.
       01  WS-COUNTER PIC 9(1) VALUE 1.
       PROCEDURE DIVISION.
           PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 2
               IF WS-COUNTER = 1 THEN
                   DISPLAY WS-HELLO
               ELSE
                   DISPLAY WS-WORLD
               END-IF
           END-PERFORM
           STOP RUN
           .
       END PROGRAM HELLO-WORLD.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXTRA-PROGRAM.
       PROCEDURE DIVISION.
           STOP RUN.
       END PROGRAM EXTRA-PROGRAM.